package com.jikaigg.blog.utils;

import cn.hutool.core.util.RandomUtil;

import java.util.Random;

public class CyRandomUtils {
    private static final String[] FIRST_NAMES = {
            "艾", "白", "包", "毕", "卞", "边", "柏", "鲍", "卜",
            "蔡", "曹", "岑", "常", "车", "陈", "程", "池", "崔", "楚", "褚",
            "戴", "邓", "狄", "丁", "董", "杜", "段", "杜",
            "范", "方", "房", "费", "丰", "封", "冯", "符", "傅",
            "高", "郜", "龚", "管", "关", "桂", "郭",
            "韩", "何", "贺", "洪", "侯", "胡", "华", "黄",
            "姬", "吉", "纪", "贾", "简", "江", "姜", "蒋", "金", "康", "孔", "匡", "黎", "李", "连", "廖", "林", "凌", "刘", "龙", "卢", "鲁", "陆", "吕", "罗",
            "马", "孟", "苗", "缪", "莫", "穆",
            "潘", "彭", "蒲",
            "齐", "钱", "乔", "秦", "邱",
            "任", "沈", "石", "史", "司", "宋", "苏", "孙",
            "汤", "唐", "田", "童",
            "王", "韦", "魏", "温", "文", "吴", "武",
            "席", "夏", "萧", "谢", "邢", "徐", "许", "薛",
            "严", "颜", "杨", "姚", "叶", "易", "殷", "尤", "余", "俞", "虞", "袁",
            "翟", "张", "章", "赵", "郑", "钟", "周", "朱", "祝", "庄", "卓",
            "曾"
    };
    private static final String[] DOUBLE_FIRST_NAMES = {
            "欧阳", "司马", "上官", "夏侯", "诸葛", "东方", "皇甫", "尉迟", "公孙", "赫连", "澹台", "公冶", "宗政",
            "濮阳", "淳于", "单于", "太叔", "申屠", "公孙", "仲孙", "轩辕", "令狐", "钟离", "宇文", "长孙", "慕容",
            "鲜于", "闾丘", "司徒", "司空", "丌官", "司寇", "仉督", "子车", "颛孙", "端木", "巫马", "公西", "漆雕",
            "乐正", "壤驷", "公良", "拓拔", "夹谷", "宰父", "谷梁", "段干", "百里", "东郭", "南门", "呼延", "羊舌",
            "微生", "公户", "公玉", "公仪", "梁丘", "左丘", "东门", "西门", "商牟", "佘阳", "言福", "丘儒", "赫谢",
            "公旦", "冶顺", "原千", "公周", "上阴", "镇远"
    };
    private static final String[] SIMPLE_NAME = {
            "东", "华", "明", "刚", "蔷", "良", "胜", "进", "远", "元", "善", "平", "鹏", "文", "武", "宏", "达", "忠", "念", "琦",
            "博", "敏", "婷", "芳", "霞", "丽", "洋", "勇", "俊", "娜", "鑫", "峰", "雪", "瑶", "桂", "莉", "飞", "兵", "楠", "庆",
            "杰", "建", "嘉", "星", "海", "亮", "静", "秀", "蕾", "月", "林", "青", "红", "云", "芬", "露", "娟", "亚", "英", "晶",
            "新", "伟", "华", "伶", "心", "慧", "思", "倩", "妍", "莹", "姗", "萍", "蓉", "秋", "冰", "娥", "玲", "凡", "淑", "宁",
            "燕", "敏", "雯", "琳", "丹", "瑶", "佳", "洁", "玉", "晓", "莲", "美", "芹", "琴", "春", "蓝", "菲", "晋", "芳", "琲",
            "媛", "媛", "芸", "蓓", "梦", "颖", "琼", "媛", "瑶", "蓉", "红", "萍", "琼", "洁", "雯", "静", "梅", "莉", "娟", "丹",
            "妍", "莉", "莹", "静", "媛", "瑶", "蓉", "红", "萍", "盛", "文", "君", "娜", "兰", "策", "青", "文", "洁", "燕", "云",
            "雯", "洁", "玲", "珍", "媛", "瑶", "梅", "蓉", "红", "萍", "艳", "丹", "琼", "泽", "彬", "若", "翔", "祥", "岩", "贵",
            "澳", "邦", "谷", "航", "钦", "煜", "宇", "栋", "鹤", "健", "宝", "浩", "凯", "旭", "龙", "轩", "德", "韬", "俊", "儒",
            "恒", "济", "俊", "彦", "琪", "睿", "昊", "强", "雄", "阳", "锋", "翰", "博", "杰", "康", "泓", "扬", "硕", "风", "炜",
            "军", "晨", "志", "岚", "帆", "宽", "辰", "竣", "俊", "雨", "杨", "旺", "成", "鸣", "菲", "炫", "一", "二", "三", "四",
            "五", "六", "七", "八", "九", "十", "恺", "久", "世", "近", "空", "学", "子", "赤", "乘", "黄", "绿", "紫", "大", "小",
            "中", "国", "果", "然", "好", "哥", "歌", "京", "个", "百", "千", "万", "白", "图", "途", "铭", "沐", "甜", "希", "牛",
            "虎", "竹", "比", "必", "同", "通", "畅", "上", "下", "左", "右", "稳", "尔", "之", "乎", "者", "也", "宾", "斌", "彤",
            "民", "恩", "麒", "麟", "衡", "才", "威", "信", "乃", "画", "桦", "正", "烨", "欣", "辉", "惠", "卉", "含", "汉", "寒",
            "镇", "振", "贞", "卫", "未", "永", "咏", "庸", "巴", "智", "治", "致", "知", "支", "丰", "凤", "亭", "廷", "灿", "圆",
            "斯", "故", "则", "冠", "首", "守", "托", "清", "晴", "利", "立", "且", "遥", "耀", "闯", "松", "嵩", "传", "川", "越",
            "语", "共", "工", "数", "书", "树", "可", "科", "卓", "慈", "茵", "点", "典", "侠", "顿", "琛", "非", "伦", "格", "权",
            "泉", "群", "均", "现", "显", "闲", "仙", "贤", "弦", "浪", "郎", "卡", "和", "合", "禾", "啦", "其", "丙", "玛", "娅",
            "雅", "哲", "时", "半", "依", "意", "亿", "亦", "艺", "娱", "欲", "望", "沃", "极", "集", "源", "原", "笑", "骁", "助",
            "莎", "舞", "洛", "牧", "步", "长", "嫦", "莱", "湾", "备", "夏", "冬", "佐", "登", "泰", "间", "剑", "酷", "番", "爽",
            "辽", "霜", "双"
    };

    public static String randomChineseName() {
        // 是否是复姓
        boolean isDoubleFirstName = new Random().nextBoolean();
        String firstName = isDoubleFirstName ? DOUBLE_FIRST_NAMES[RandomUtil.randomInt(DOUBLE_FIRST_NAMES.length)] : FIRST_NAMES[RandomUtil.randomInt(FIRST_NAMES.length)];
        // 是否是双字名
        boolean isDoubleLastName = new Random().nextBoolean();
        String lastName = isDoubleLastName ? SIMPLE_NAME[RandomUtil.randomInt(SIMPLE_NAME.length)] : (SIMPLE_NAME[RandomUtil.randomInt(SIMPLE_NAME.length)] + SIMPLE_NAME[RandomUtil.randomInt(SIMPLE_NAME.length)]);
        return firstName + lastName;
    }
}
